Revit 2024 API
ConnectorElement.Direction Property
 Gets the direction of the connector element.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2014
Syntax
C#
public XYZ Direction { get; }
Visual Basic
Public ReadOnly Property Direction As XYZ
	Get
Visual C++
public:
property XYZ^ Direction {
	XYZ^ get ();
}
See Also
ConnectorElement Class
Autodesk.Revit.DB Namespace